import random
import os
from telethon import events, types
from telethon.tl import functions
from telethon.tl.functions.messages import GetCustomEmojiDocumentsRequest
from telethon.extensions import html, markdown
from telethon.errors.rpcerrorlist import ChatSendMediaForbiddenError
from ..core.managers import edit_or_reply, edit_delete
from ..Config import Config
from ..sql_helper.globals import gvarstatus
from . import l313l

# المتغيرات الأساسية
ZED_BLACKLIST = [-1001935599871]
Zel_Uid = l313l.uid
plugin_category = "utils"

# كلاس التحليل المخصص
class CustomParseMode:
    def __init__(self, parse_mode: str):
        self.parse_mode = parse_mode

    def parse(self, text):
        if self.parse_mode == 'html':
            text, entities = html.parse(text)
            # معالجة إيموجيات البريميوم
            for i, e in enumerate(entities):
                if isinstance(e, types.MessageEntityTextUrl):
                    if e.url.startswith('emoji/'):
                        document_id = int(e.url.split('/')[1])
                        entities[i] = types.MessageEntityCustomEmoji(
                            offset=e.offset,
                            length=e.length,
                            document_id=document_id
                        )
            return text, entities
        elif self.parse_mode == 'markdown':
            return markdown.parse(text)
        raise ValueError("Unsupported parse mode")

    @staticmethod
    def unparse(text, entities):
        return html.unparse(text, entities)
rehu = [
    "قال المهدي(عجل الله فرجه):الدّينُ لمحمّد صلى الله عليه وآله وسلم والهدايةُ لعَلِيٍّ أمير المؤمنين ع، لأنها لهُ وفي عَقِبِه باقيةً إلى يومِ القيامة",
    "قال المهدي(عجل الله فرجه):إذا استغفرت الله (عز وجل) فالله يغفر لك",
    "قال المهدي(عجل الله فرجه):لا يحلّ لأحد أن يتصرّف في مال غيره بغير إذنه",
    "قال المهدي(عجل الله فرجه):إن اُستَرشدت أُرشِدتَ، وإن طَلبت وجدت",
    "قَالَ الإمام علي (عليه السلام): يَا ابْنَ آدَمَ إِذَا رَأَيْتَ رَبَّكَ سُبْحَانَهُ يُتَابِعُ عَلَيْكَ نِعَمَهُ وَأَنْتَ تَعْصِيهِ فَاحْذَرْهُ",
    "قَالَ الإمام علي (عليه السلام): الصَّبْرُ صَبْرَانِ صَبْرٌ عَلَى مَا تَكْرَهُ وَصَبْرٌ عَمَّا تُحِبُّ",
    "قَالَ الإمام علي (عليه السلام): لَا يَكُونُ الصَّدِيقُ صَدِيقاً حَتَّى يَحْفَظَ أَخَاهُ فِي ثَلَاثٍ فِي نَكْبَتِهِ وَغَيْبَتِهِ وَوَفَاتِهِ",
    "قال الإمام الصادق(عليه السلام): اكتبوا فإنكم لا تحفظون حتى تكتبو",
    "قال الإمام الصادق(عليه السلام): ركعة يصليها الفقيه أفضل من سبعين ألف ركعة يصليها العابد",
    "قال الإمام الصادق(عليه السلام): طلب العلم فريضة من فرائض الله",
    "عن رسول الله (صلى الله عليه وآله): الْبَخِيلُ‏ حَقّاً مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ",
    "عن رسول الله (صلى الله عليه وآله): مَنْ أَتَانِي ��َائِراً كُنْتُ شَفِيعَهُ‏ يَوْمَ‏ الْقِيَامَة",
    "عن رسول الله (صلى الله عليه وآله): بُغْضُ‏ عَلِيٍ‏ كُفْرٌ وَ بُغْضُ بَنِي هَاشِمٍ نِفَاقٌ",
    "عن الامام علي (عليه السلام) قال : أعظم الذنوب ما استخف به صاحبه",
    "عن الامام علي (عليه السلام) قال : إذا قويت فاقو على طاعة الله، وإذا ضعفت فاضعف في معصيته",
    "عن الامام علي (عليه السلام) قال : أعداؤك ثلاثة: عدوك، وصديق عدوك، وعدو صديقك",
    "عن الامام علي (عليه السلام) قال : لا غنى كالعقل، ولا فقر كالجهل، ولا ميراث كالأدب",
    "عن الامام علي (عليه السلام) قال : لسانك حصانك، إن صنته صانك",
]

@l313l.ar_cmd(
    pattern="الاوامر(?:\s|$)([\s\S]*)",
    command=("الاوامر", plugin_category),
    info={
        "header": "امـر مختصـر لـ عـرض قائـمة الاوامـر",
        "الاستـخـدام": " {tr}الإوامر",
    },
)
async def show_commands(event):
    if (event.chat_id in ZED_BLACKLIST) and (Zel_Uid not in Zed_Dev):
        return await edit_or_reply(event, "**- عـذراً .. عـزيـزي 🚷\n- لا تستطيـع استخـدام هـذا الامـر هـنا 🚫**")
    
    zed = await edit_or_reply(event, "**⇆ جاري تجهيز الأوامر...**")
    lMl10l = random.choice(rehu)
    
    # التحقق إذا كان المستخدم لديه بريميوم
    try:
        mypremium = (await event.client.get_entity(Zel_Uid)).premium
    except:
        mypremium = False
    
    if mypremium:
        # النسخة الفخمة للمستخدمين بريميوم
        caption = f"<b>✦ قائـمة اوامـر سـورس آراس </b>"
        caption += f'<a href="emoji/5668127928907464707">❤️</a>\n\n'
        
        caption += (
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م1</code> ⦙ أوامر الإدارة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م2</code> ⦙ أوامر المجموعة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م3</code> ⦙ أوامر الترحيب والردود\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م4</code> ⦙ حماية الخاص والتلكراف\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م5</code> ⦙ أوامر المنشن والانتحال\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م6</code> ⦙ أوامر التحميل والترجمة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م7</code> ⦙ أوامر المنع والقفل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م8</code> ⦙ أوامر التنظيف والتكرار\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م9</code> ⦙ أوامر التخصيص والفارات\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م10</code> ⦙ أوامر الوقتي والتشغيل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م11</code> ⦙ أوامر الكشف والروابط\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م12</code> ⦙ أوامر المساعدة والإذاعة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م13</code> ⦙ أوامر الإرسال والأذكار\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م14</code> ⦙ أوامر الملصقات وكوكل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م15</code> ⦙ أوامر التسلية والميمز\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م16</code> ⦙ أوامر الصيغ والجهات\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م17</code> ⦙ أوامر التمبلر والزغرفة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م18</code> ⦙ أوامر الحساب والترفيه\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م19</code> ⦙ أوامر الميوزك والتشغيل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م20</code> ⦙ أوامر بصمات الميمز\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م21</code> ⦙ أوامر تجميع النقاط وبوت وعد\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م22</code> ⦙ أوامر الذاتية للبصمات والصور\n'
            f'ٴ<a href="emoji/6323136954380585694">❤️</a>'
            f'<a href="emoji/6325684673145997914">❤️</a>'
            f'<a href="emoji/6323205570778107774">❤️</a>'
            f'<a href="emoji/6323518746908428943">❤️</a>'
            f'<a href="emoji/5834774412338927340">❤️</a>'
            f'<a href="emoji/6325480992911919689">❤️</a>'
            f'<a href="emoji/6323564170482551899">❤️</a>'
            f'<a href="emoji/6323191058083613275">❤️</a>'
            f'<a href="emoji/6325310787652946500">❤️</a>\n'
            f'<a href="emoji/5222295067858855800">❤️</a> <b>┊ حكمة اليوم:</b>\n'
            f"<code>{lMl10l}</code>\n"
            f'ٴ<a href="emoji/6323136954380585694">❤️</a>'
            f'<a href="emoji/6325684673145997914">❤️</a>'
            f'<a href="emoji/6323205570778107774">❤️</a>'
            f'<a href="emoji/6323518746908428943">❤️</a>'
            f'<a href="emoji/5463151916080966718">❤️</a>'
            f'<a href="emoji/6325480992911919689">❤️</a>'
            f'<a href="emoji/6323564170482551899">❤️</a>'
            f'<a href="emoji/6323191058083613275">❤️</a>'
            f'<a href="emoji/6325310787652946500">❤️</a>\n'
            f'<a href="emoji/5219998342687242062">❤️</a> <b> المـطـور: @Lx5x5</b>\n'
        )
        
        try:
            await event.client.send_message(
                event.chat_id,
                caption,
                link_preview=False,
                parse_mode=CustomParseMode("html"),
            )
            await zed.delete()
        except Exception as e:
            await edit_or_reply(zed, f"**حدث خطأ:** {str(e)}")
    
    else:
        # النسخة العادية للمستخدمين بدون بريميوم
        await zed.edit(
            f"**✦ قائـمة اوامـر سـورس آراس **"
            f"\n\n"
            f"**• `.م1`  ⦙  أوامر الإدارة **\n"
            f"**• `.م2`  ⦙  أوامر المجموعة **\n"
            f"**• `.م3`  ⦙  أوامر الترحيب والردود **\n"
            f"**• `.م4`  ⦙  حماية الخاص والتلكراف **\n"
            f"**• `.م5`  ⦙  أوامر المنشن والانتحال **\n"
            f"**• `.م6`  ⦙  أوامر التحميل والترجمة **\n"
            f"**• `.م7`  ⦙  أوامر المنع والقفل **\n"
            f"**• `.م8`  ⦙  أوامر التنظيف والتكرار **\n"
            f"**• `.م9`  ⦙  أوامر التخصيص والفارات **\n"
            f"**• `.م10` ⦙  أوامر الوقتي والتشغيل **\n"
            f"**• `.م11` ⦙  أوامر الكشف والروابط **\n"
            f"**• `.م12` ⦙  أوامر المساعدة والإذاعة **\n"
            f"**• `.م13` ⦙  أوامر الإرسال والأذكار **\n"
            f"**• `.م14` ⦙  أوامر الملصقات وكوكل **\n"
            f"**• `.م15` ⦙  أوامر التسلية والميمز **\n"
            f"**• `.م16` ⦙  أوامر الصيغ والجهات **\n"
            f"**• `.م17` ⦙  أوامر التمبلر والزغرفة **\n"
            f"**• `.م18` ⦙  أوامر الحساب والترفيه **\n"
            f"**• `.م19` ⦙  أوامر الميوزك والتشغيل **\n"
            f"**• `.م20` ⦙  أوامر بصمات الميمز **\n"
            f"**• `.م21` ⦙  أوامر تجميع النقاط وبوت وعد **\n"
            f"**• `.م22` ⦙  أوامر الذاتية للبصمات والصور **\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━\n"
            f"**📜┊ حكمة اليوم:**\n"
            f"`{lMl10l}`\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━\n"
            f"**⚡┊ المطور: @Lx5x5**\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━"
        )

commands = {
    "م1": """** قائمة اوامر الادمن لسورس آراس **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الحظر` )
- ( `.اوامر الكتم` )
- ( `.اوامر التثبيت` )
- ( `.اوامر الاشراف` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م2": """** قائمة اوامر المجـموعه لسورس آراس **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التفليش` )
- ( `.اوامر المحذوفين` )
- ( `.اوامر الكروب` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م3": """** قائمة اوامر الـترحيب والـردود **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الترحيب` )
- ( `.اوامر الردود` )
- ( `.اوامر المحاكاة` )
- ( `.اوامر ترحيب البوت` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م4": """** قائمة اوامر حـماية الخاص والتلكراف **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الحماية` )
- ( `.اوامر التلكراف` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م5": """** قائمة اوامر الـمنشن والانتحال **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الانتحال` )
- ( `.اوامر التقليد` )
- ( `.اوامر المنشن` )
- ( `.اوامر المنشن2` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م6": """** قائمة اوامر التحميل والترجمه **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر النطق` )
- ( `.اوامر التحميل` )
- ( `.اوامر الترجمة` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م7": """** قائمة اوامر القفل والمنع **:
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر القفل` )
- ( `.اوامر الفتح` )
- ( `.اوامر المنع` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م8": """** قائمة اوامر التكرار والتنظيف **:
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التكرار` )
- ( `.اوامر السبام` )
- ( `.اوامر التنظيف` )
- ( `.اوامر المسح` )
- ( `.اوامر الرسائل الموقته` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م9": """** قائمة التخصيص والفارات **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التخصيص` )
لتغير الصور والكلايش كل من الحماية والفحص والبنك
- ( `.اوامر الفارات` )
- لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م10": """** قائمة اوامر الوقتي والتشغيل **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الاسم` )
- ( `.اوامر البايو` )
- ( `.اوامر الكروب الوقتي` )
- ( `.اوامر التشغيل` )
- ( `.اوامر الاطفاء` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م11": """** قائمة اوامر الكـشف و الروابط **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الكشف` )
- ( `.اوامر الروابط` )

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م12": """** قائمة اوامر المساعدة  **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الوقت والتاريخ` )
- ( `.اوامر كورونا` )
- ( `.اوامر الصلاة` )
- ( `.اوامر مساعدة` )
- ( `.اوامر الاذاعه` )
- ( `.اوامر الوقتي` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م13": """** قائمة اوامر الارسال **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التحذيرات` )
- ( `.اوامر اللستة` )
- ( `.اوامر الملكية` )
- ( `.اوامر السليب` )
- ( `.اوامر الاذكار` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م14": """** قائمة اوامر الملصقات وكوكل **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الملصقات` )
- ( `.اوامر كوكل` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م15": """** قائمة اوامر التسلية والتحشيش **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التسلية` )
- ( `.اوامر التحشيش` )
- ( `.اوامر الميمز` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م16": """** قائمة اوامر تحويل الصيغ و الجهات **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التحويل` )
- ( `.اوامر الجهات` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م18": """** قائمة اوامر الحساب و الترفيه **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الترفيه` )
- ( `.اوامر الحساب` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م19": """ قائمة اوامر الميوزك والتشغيل 🎵
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر
 ᯽︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` )
- ( `.تشغيل_المكالمة` )
- لتشغيل المحادثة الصوتيه
- ( `.انهاء_المكالمة` )
-لأنهاء المحادثه الصوتية
- ( `.دعوة` )
- بالرد على الشخص لدعوته الى المكالمة
- ( `.معلومات_المكالمة` )
- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها
- ( `.تسمية_المكالمة` )
- لتغير عنوان المكالمة
- ( `.انضمام` )
- للأنضمام الى المحادثة الصوتية
- ( `.مغادرة` )
- لمغادرة المحادثة الصوتية
- ( `.تشغيل` )
-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه
- ( `.قائمة_التشغيل` )
- لعرض قائمة التشغيل
- ( `.ايقاف_مؤقت` )
- لأيقاف الاغنية الحالية مؤقتا
- ( `.استمرار` )
-لأستمرار الاغنيه التي تم ايقافها
- ( `.تخطي` )
- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م20": """** قائمة اوامر بصمات الميمز **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ إليك اوامر بصمات الميمز

- ( `.اوامر بصمات الميمز` )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م21": """** قائمة اوامر تجميع النقاط و بوت وعد **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التجميع` )
- ( `.اوامر وعد` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م22": """** قائمة اوامر الذاتية للبصمات والصور **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الصوره الذاتيه` )
- ( `.اوامر البصمه الذاتيه` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev :@Lx5x5"""
}

@l313l.ar_cmd(pattern="(م1|م2|م3|م4|م5|م6|م7|م8|م9|م10|م11|م12|م13|م14|م15|م16|م18|م19|م20|م21|م22)$")
async def handle_commands(event):
    command = event.pattern_match.group(1)
    if command in commands:
        await event.edit(commands[command])




#------------------------------------------------------------------------------
#------------------------------------------------------------------------------
#------------------------------------------------------------------------------
#------------------------------------------------------------------------------

import random
from telethon import events
import random, re

from JoKeRUB.utils import admin_cmd

import asyncio
from JoKeRUB import l313l

from ..core.managers import edit_or_reply

plugin_category = "extra"

# اوامر الادمن لسورس آراس

@l313l.ar_cmd(
    pattern="اوامر الحظر$",
    command=("اوامر الحظر", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الحظر 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.حظر` ⦘
❐ حظر عضو من المجموعة
❐ طريقة الاستخدام: .حظر بالرد على العضو

☑️ ⦗ `.الغاء حظر` ⦘
❐ إلغاء حظر عضو محظور
❐ طريقة الاستخدام: .الغاء حظر بالرد على العضو

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الكتم$",
    command=("اوامر الكتم", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الكتم 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.كتم` ⦘
❐ كتم عضو في المجموعة
❐  طريقة الاستخدام:  .كتم بالرد على العضو او كتابة يوزره

☑️ ⦗ `.الغاء كتم` ⦘
❐ إلغاء كتم عضو مكتوم
❐ طريقة الاستخدام: .الغاء كتم بالرد على العضو او كتابة يوزره

☑️ ⦗ `.كتم_مؤقت` ⦘
❐ كتم عضو مؤقتاً لمدة محددة
❐ طريقة  او كتابة يوزره الاستخدام: .كتم_مؤقت 1h السبب

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التثبيت$",
    command=("اوامر التثبيت", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التثبيت 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تثبيت` ⦘
❐ تثبيت رسالة في المجموعة
❐ طريقة الاستخدام: .تثبيت بالرد على الرسالة

☑️ ⦗ `.الغاء التثبيت` ⦘
❐ إلغاء تثبيت رسالة مثبتة
❐ طريقة الاستخدام: .الغاء التثبيت بالرد على الرسالة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الاشراف$",
    command=("اوامر الاشراف", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الاشراف 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.رفع مشرف` ⦘
❐ رفع عضو كمشرف في المجموعة
❐ طريقة الاستخدام: .رفع مشرف بالرد على العضو او كتابة يوزره

☑️ ⦗ `.تك` ⦘
❐ تنزيل عضو من الاشراف
❐ طريقة الاستخدام: .تك بالرد على العضو او كتابة يوزره

☑️ ⦗ `.ارفع` ⦘
❐ رفع المشرف في جميع المجموعات
❐ مع كافة الصلاحيات ولقب مخفي

☑️ ⦗ `.نزل` ⦘
❐ تنزيل الشخص من رتبة الاشراف
❐ في جميع المجموعات

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

# اوامر المجموعة لسورس آراس

@l313l.ar_cmd(
    pattern="اوامر التفليش$",
    command=("اوامر التفليش", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التفليش 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تفليش بالطرد` ⦘
❐ طرد جميع أعضاء المجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.تفليش` ⦘
❐ حظر جميع أعضاء المجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.حظر_الكل` ⦘
❐ حظر الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

☑️ ⦗ `.طرد_الكل` ⦘
❐ طرد الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

☑️ ⦗ `.كتم_الكل` ⦘
❐ كتم الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المحذوفين$",
    command=("اوامر المحذوفين", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المحذوفين 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.حذف المحظورين` ⦘
❐ إلغاء حظر جميع المحظورين
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.اطردني` ⦘
❐ مغادرة المجوعة تلقائياً
❐ طريقة الاستخدام: إرسال الأمر في المجموعة

☑️ ⦗ `.المحذوفين` ⦘
❐ عرض الحسابات المحذوفة
❐ طريقة الاستخدام: .المحذوفين اطردهم

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الكروب$",
    command=("اوامر الكروب", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الكروب 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.الاحداث` ⦘
❐ عرض أحداث الكروب
❐ طريقة الاستخدام: في الكروب

☑️ ⦗ `.الاعضاء` ⦘
❐ عرض أعضاء المجموعة
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.المشرفين` ⦘
❐ عرض حسابات المشرفين
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.البوتات` ⦘
❐ عرض البوتات في المجموعة
❐ طريقة الاستخدام: في المجموعة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الترحيب$",
    command=("اوامر الترحيب", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الترحيب 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ترحيب` ⦘
❐ وضع ترحيب للاعضاء الجدد
❐ طريقة الاستخدام: .ترحيب اهلاً وسهلاً

☑️ ⦗ `.حذف الترحيب` ⦘
❐ حذف جميع الترحيبات
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الترحيب` ⦘
❐ عرض الترحيبات الحالية
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.الترحيب السابق` ⦘
❐ تشغيل/ايقاف آخر ترحيب
❐ طريقة الاستخدام: .الترحيب السابق تشغيل/ايقاف

☑️ ⦗ `.رحب` ⦘
❐ ترحيب في الخاص عند الانضمام
❐ طريقة الاستخدام: .رحب مرحباً بك

☑️ ⦗ `.حذف رحب` ⦘
❐ حذف الترحيب في الخاص
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الترحيب1` ⦘
❐ نضام ترحيب بواسطه البوت الذي في المجموعة 
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الردود$",
    command=("اوامر الردود", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الردود 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.رد` ⦘
❐ إضافة رد تلقائي
❐ طريقة الاستخدام: مثال .رد سلام عليكم بالرد على رساله وعليكم السلام

☑️ ⦗ `.مسح الردود` ⦘
❐ حذف جميع الردود المضافة
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الردود` ⦘
❐ عرض قائمة الردود الحالية
❐ طريقة الاستخدام: في المجموعة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المحاكاة$",
    command=("اوامر المحاكاة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المحاكاة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تفعيل اعلام` ⦘
❐ تفعيل الرد على الأعلام
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تعطيل اعلام` ⦘
❐ تعطيل الرد على الأعلام
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تفعيل نص اعلام` ⦘
❐ تعيين نص محفز للأعلام
❐ طريقة الاستخدام: مع النص
•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•

☑️ ⦗ `.تفعيل معاني` ⦘
❐ تفعيل الرد على معاني السمايلات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تعطيل معاني` ⦘
❐ تعطيل الرد على معاني السمايلات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تفعيل نص معاني` ⦘
❐ تعيين نص محفز للمعاني
❐ طريقة الاستخدام: مع النص
•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•

☑️ ⦗ `.تفعيل تفكيك` ⦘
❐ تفعيل تفكيك الكلمات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تعطيل تفكيك` ⦘
❐ تعطيل تفكيك الكلمات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تفعيل نص تفكيك` ⦘
❐ تعيين نص محفز للتفكيك
❐ طريقة الاستخدام: مع النص
•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•

☑️ ⦗ `.تفعيل مقالات` ⦘
❐ تفعيل الرد على المقالات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تعطيل مقالات` ⦘
❐ تعطيل الرد على المقالات
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تفعيل نص مقالات` ⦘
❐ تعيين نص محفز للمقالات
❐ طريقة الاستخدام: مع النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الحماية$",
    command=("اوامر الحماية", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الحماية 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.الحماية` ⦘
❐ تشغيل/تعطيل الحماية في الخاص
❐ طريقة الاستخدام: .الحماية تشغيل/تعطيل

☑️ ⦗ `.سماح` ⦘
❐ السماح للشخص بالتكلم في الخاص
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.رفض` ⦘
❐ رفض الشخص من الخاص
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.المسموح لهم` ⦘
❐ عرض قائمة المسموح والمرفوضين
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التلكراف$",
    command=("اوامر التلكراف", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التلكراف 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تلكراف ميديا` ⦘
❐ تحويل الصورة إلى رابط تلكراف
❐ طريقة الاستخدام: بالرد على الصورة

☑️ ⦗ `.تلكراف نص` ⦘
❐ تحويل النص إلى رابط تلكراف
❐ طريقة الاستخدام: بالرد على النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الانتحال$",
    command=("اوامر الانتحال", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الانتحال 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.انتحال` ⦘
❐ نسخ حساب شخص بالكامل
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.اعادة` ⦘
❐ إرجاع الحساب إلى وضعه الطبيعي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انتحال_الدردشه` ⦘
❐ انتحال دردشة معينة
❐ طريقة الاستخدام: .انتحال_الدردشه معرف

☑️ ⦗ `.اعادة_الدردشه` ⦘
❐ إرجاع الدردشة إلى وضعها الطبيعي
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التقليد$",
    command=("اوامر التقليد", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التقليد 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تقليد` ⦘
❐ تقليد جميع رسائل الشخص
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.الغاء التقليد` ⦘
❐ إيقاف تقليد الشخص
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.المقلدهم` ⦘
❐ عرض قائمة الأشخاص المقلدهم
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.مسح المقلدهم` ⦘
❐ مسح قائمة المقلدهم
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المنشن$",
    command=("اوامر المنشن", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المنشن 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.منشن` ⦘
❐ عمل تاك مفرد للأعضاء
❐ طريقة الاستخدام: .منشن المسج

☑️ ⦗ `.الغاء منشن` ⦘
❐ إلغاء التاك
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المنشن2$",
    command=("اوامر المنشن2", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المنشن 2 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.منشن_كل_5دقايق` ⦘
❐ تاك متقطع كل 5 دقائق
❐ طريقة الاستخدام: .منشن_كل_5دقايق المسج

☑️ ⦗ `.الغاء_منشن_كل_5دقايق` ⦘
❐ إلغاء التاك المتقطع
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التحميل$",
    command=("اوامر التحميل", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التحميل 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.يوت` ⦘
❐ البحث عن أغنية
❐ طريقة الاستخدام: .بحث اسم الاغنية

☑️ ⦗ `.تفعيل يوت ` ⦘
❐ لتسمح ب استخدام امر يوت للأشخاص الآخرين
❐ طريقة الاستخدام: .تفعيل يوت - في الخاص سيصبح لجميع الدردشات الخاصة & في كروب معين 

☑️ ⦗ `.تعطيل يوت` ⦘
❐ لتعطيل استخدام امر يوت 
❐ طريقة الاستخدام: .تعطيل يوت
•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•

☑️ ⦗ `.فيديو` ⦘
❐ البحث عن أغنية
❐ طريقة الاستخدام: .بحث اسم الاغنية

☑️ ⦗ `.تفعيل فيديو` ⦘
❐ لتسمح ب استخدام امر فيديو للأشخاص الآخرين
❐ طريقة الاستخدام: .تفعيل فيديو - في الخاص سيصبح لجميع الدردشات الخاصة & في كروب معين 

☑️ ⦗ `.تعطيل فيديو` ⦘
❐ لتعطيل استخدام امر فيديو 
❐ طريقة الاستخدام: .تعطيل فيديو
•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•

☑️ ⦗ `.انستا` ⦘
❐ تحميل من الانستغرام
❐ طريقة الاستخدام: .انستا الرابط

☑️ ⦗ `.فيس` ⦘
❐ تحميل من الفيس بوك
❐ طريقة الاستخدام: .فيس الرابط

☑️ ⦗ `.بنترست` ⦘
❐ تحميل من بنترست
❐ طريقة الاستخدام: .بنترست الرابط

☑️ ⦗ `.تيك` ⦘
❐ تحميل من تيك توك
❐ طريقة الاستخدام: .تيك الرابط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الترجمة$",
    command=("اوامر الترجمة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الترجمة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ترجمة ar` ⦘
❐ ترجمة النص إلى العربية
❐ طريقة الاستخدام: بالرد على النص

☑️ ⦗ `.ترجمة en` ⦘
❐ ترجمة النص إلى الإنجليزية
❐ طريقة الاستخدام: بالرد على النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر النطق$",
    command=("اوامر النطق", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر النطق 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تكلم ar` ⦘
❐ تحويل النص إلى صوت عربي
❐ طريقة الاستخدام: بالرد على النص

☑️ ⦗ `.تكلم en` ⦘
❐ تحويل النص إلى صوت إنجليزي
❐ طريقة الاستخدام: بالرد على النص

☑️ ⦗ `.احجي ar` ⦘
❐ تحويل الصوت إلى نص عربي
❐ طريقة الاستخدام: بالرد على البصمة

☑️ ⦗ `.احجي en` ⦘
❐ تحويل الصوت إلى نص إنجليزي
❐ طريقة الاستخدام: بالرد على البصمة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر القفل$",
    command=("اوامر القفل", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر القفل 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.قفل` ⦘
❐ قفل شي معين في المجموعة
❐ طريقة الاستخدام: .قفل الاضافة

الاضافات:
• الدردشه - الوسائط - الملصقات
• الروابط - المتحركه - الالعاب
• الانلاين - التصويت - الكل

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الفتح$",
    command=("اوامر الفتح", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الفتح 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.فتح` ⦘
❐ فتح شي معين في المجموعة
❐ طريقة الاستخدام: .فتح الاضافة

الاضافات:
• الدردشه - الوسائط - الملصقات
• الروابط - المتحركه - الالعاب
• الانلاين - التصويت - الكل

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المنع$",
    command=("اوامر المنع", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المنع 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.منع` ⦘
❐ منع كلمة/ملصق/متحركه
❐ طريقة الاستخدام: .منع الكلمة

☑️ ⦗ `.الغاء منع` ⦘
❐ إلغاء منع الكلمة
❐ طريقة الاستخدام: .الغاء منع الكلمة

☑️ ⦗ `.قائمة المنع` ⦘
❐ عرض قائمة المنع
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 1$",
    command=("تسلية 1", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 1 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.غبي` ⦘
☑️ ⦗ `.القنابل` ⦘
☑️ ⦗ `.اتصل` ⦘
☑️ ⦗ `.قتل` ⦘
☑️ ⦗ `.شنو` ⦘
☑️ ⦗ `.طوبة` ⦘
☑️ ⦗ `.مربعات` ⦘
☑️ ⦗ `.حلويات` ⦘
☑️ ⦗ `.نار` ⦘
☑️ ⦗ `.شحن` ⦘

⚠️ تحذير: لا تكثر من الاستخدام

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 2$",
    command=("تسلية 2", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 2 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.افكر` ⦘
☑️ ⦗ `.متت` ⦘
☑️ ⦗ `.ضايج` ⦘
☑️ ⦗ `.ساعه` ⦘
☑️ ⦗ `.مح` ⦘
☑️ ⦗ `.قلب` ⦘
☑️ ⦗ `.جيم` ⦘
☑️ ⦗ `.الارض` ⦘
☑️ ⦗ `.قمر` ⦘
☑️ ⦗ `.اقمار` ⦘
☑️ ⦗ `.قمور` ⦘

⚠️ تحذير: لا تكثر من الاستخدام

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 3$",
    command=("تسلية 3", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 3 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.نجمه` ⦘
☑️ ⦗ `.مكعبات` ⦘
☑️ ⦗ `.مطر` ⦘
☑️ ⦗ `.تفريغ` ⦘
☑️ ⦗ `.فليم` ⦘
☑️ ⦗ `.احبك` ⦘
☑️ ⦗ `.طائره` ⦘
☑️ ⦗ `.شرطه` ⦘
☑️ ⦗ `.النضام الشمسي` ⦘

⚠️ تحذير: لا تكثر من الاستخدام

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 4$",
    command=("تسلية 4", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 4 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.قاتل` ⦘
☑️ ⦗ `.عين` ⦘
☑️ ⦗ `.افكرر` ⦘
☑️ ⦗ `.افعى` ⦘
☑️ ⦗ `.رجل` ⦘
☑️ ⦗ `.مايكرو` ⦘
☑️ ⦗ `.فايروس` ⦘
☑️ ⦗ `.قطار` ⦘
☑️ ⦗ `.نيكول` ⦘
☑️ ⦗ `.موسيقى` ⦘
☑️ ⦗ `.رسم` ⦘

⚠️ تحذير: لا تكثر من الاستخدام

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 5$",
    command=("تسلية 5", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 5 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تحميل` ⦘
☑️ ⦗ `.مربع` ⦘
☑️ ⦗ `.دائره` ⦘
☑️ ⦗ `.انيم` ⦘
☑️ ⦗ `.بشره` ⦘
☑️ ⦗ `.قرد` ⦘
☑️ ⦗ `.يد` ⦘
☑️ ⦗ `.العد التنازلي` ⦘
☑️ ⦗ `.قلوب` ⦘

⚠️ تحذير: لا تكثر من الاستخدام

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 6$",
    command=("تسلية 6", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 6 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ترامب + النص` ⦘
☑️ ⦗ `.مودي + النص` ⦘
☑️ ⦗ `.بنر + النص` ⦘
☑️ ⦗ `.كانا + النص` ⦘
☑️ ⦗ `.تويت + المعرف ; النص` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 7$",
    command=("تسلية 7", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 7 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تراش` ⦘
❐ بالرد على ملصق/صورة

☑️ ⦗ `.تهديد` ⦘
❐ بالرد على ملصق/صورة

☑️ ⦗ `.فخ` ⦘
❐ بالرد على ملصق/صورة + الاسم1 ; الاسم2

☑️ ⦗ `.بورن` ⦘
❐ بالرد على ملصق/صورة + المعرف ; النص

☑️ ⦗ `.تويت` ⦘
❐ + المعرف ; النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="تسلية 8$",
    command=("تسلية 8", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - تسلية 8 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.نص + النص` ⦘
☑️ ⦗ `.ستيكر + النص` ⦘
☑️ ⦗ `.هونك + النص` ⦘
☑️ ⦗ `.تغريد + النص` ⦘
☑️ ⦗ `.غلاكس + النص` ⦘
☑️ ⦗ `.دوغي + النص` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الملصقات$",
    command=("اوامر الملصقات", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الملصقات 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ملصق` ⦘
❐ أخذ الملصق وإضافته لحزمة خاصة
❐ طريقة الاستخدام: بالرد على الملصق

☑️ ⦗ `.حزمة` ⦘
❐ نسخ الحزمة كاملة
❐ طريقة الاستخدام: بالرد على الملصق

☑️ ⦗ `.حزمه` ⦘
❐ نسخ الحزمة كاملة
❐ طريقة الاستخدام: بالرد على الملصق

☑️ ⦗ `.معلومات_الملصق` ⦘
❐ عرض معلومات الحزمة
❐ طريقة الاستخدام: بالرد على الملصق

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التكرار$",
    command=("اوامر التكرار", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التكرار 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.كرر` ⦘
❐ تكرار النصوص والوسائط
❐ طريقة الاستخدام: .كرر 10 بالرد

☑️ ⦗ `.تكرار الملصق` ⦘
❐ استخراج جميع ملصقات الحزمة
❐ طريقة الاستخدام: بالرد على الملصق

☑️ ⦗ `.مكرر` ⦘
❐ تكرار مع وقت محدد
❐ طريقة الاستخدام: .مكرر 10 2 بالرد

☑️ ⦗ `.ضع تكرار` ⦘
❐ منع التكرار بالعدد المحدد
❐ طريقة الاستخدام: .ضع تكرار 10

☑️ ⦗ `.ايقاف التكرار` ⦘
❐ إيقاف جميع التكرارات
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر السبام$",
    command=("اوامر السبام", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر السبام 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.سبام` ⦘
❐ تفصيخ أحرف الكلمة وإرسالها
❐ طريقة الاستخدام: .سبام كلمة

☑️ ⦗ `.وسبام` ⦘
❐ تفصيخ الجملة كلمة كلمة
❐ طريقة الاستخدام: .وسبام الجملة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التنظيف$",
    command=("اوامر التنظيف", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التنظيف 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تنظيف` ⦘
❐ حذف عدد معين من الرسائل
❐ طريقة الاستخدام: .تنظيف 10

☑️ ⦗ `.تنظيف` ⦘
❐ تنظيف حسب النوع مع (-)
❐ طريقة الاستخدام: .تنظيف -ح

الاضافات:
- (-ب): حذف الرسائل الصوتية
- (-م): حذف الملفات
- (-ح): حذف المتحركة
- (-ص): حذف الصور
- (-غ): حذف الأغاني
- (-ق): حذف الملصقات
- (-ر): حذف الروابط
- (-ف): حذف الفيديوهات

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المسح$",
    command=("اوامر المسح", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المسح 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.مسح` ⦘
❐ حذف رسالة محددة
❐ طريقة الاستخدام: بالرد على الرسالة

☑️ ⦗ `.حذف رسائلي` ⦘
❐ حذف جميع رسائلك
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الرسائل الموقته$",
    command=("اوامر الرسائل الموقته", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الرسائل الموقتة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ضبط_المؤقت` ⦘
❐ ضبط وقت حذف الرسائل تلقائياً
❐ طريقة الاستخدام: .ضبط_المؤقت 10

☑️ ⦗ `.تعطيل_المؤقت` ⦘
❐ إيقاف حذف الرسائل التلقائي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.مؤقت` ⦘
❐ إرسال رسالة مؤقتة
❐ طريقة الاستخدام: .مؤقت 5 النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الوقت والتاريخ$",
    command=("اوامر الوقت والتاريخ", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الوقت والتاريخ 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تاريخ` ⦘
❐ عرض سجل أسماء الحساب
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.الوقت` ⦘
❐ عرض الوقت على شكل ملصق
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.وقت` ⦘
❐ عرض الوقت على شكل كتابة
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.مؤقت` ⦘
❐ إرسال رسالة مؤقتة
❐ طريقة الاستخدام: .مؤقت 5 النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الوقتي$",
    command=("اوامر الوقتي", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الوقتي 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تفعيل_وقتي` ⦘
❐ تفعيل إرسال الوقت التلقائي
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.تعطيل_وقتي` ⦘
❐ تعطيل إرسال الوقت التلقائي
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الصلاة$",
    command=("اوامر الصلاة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الصلاة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.صلاة` ⦘
❐ الحصول على أوقات الصلاة
❐ طريقة الاستخدام: .صلاة المحافظة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر مساعدة$",
    command=("اوامر مساعدة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المساعدة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.موقع` ⦘
❐ الحصول على مكان في الخريطة
❐ طريقة الاستخدام: .موقع المكان

☑️ ⦗ `.جد بكج` ⦘
❐ معرفة وجود البكج أو المكتبة
❐ طريقة الاستخدام: .جد بكج الاسم

☑️ ⦗ `.صورة` ⦘
❐ الحصول على صورة الحساب
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.صوره كلها` ⦘
❐ الحصول على جميع صور الحساب
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.سرعة النت` ⦘
❐ قياس سرعة الانترنت
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.حساب` ⦘
❐ حل المعادلات الرياضية
❐ طريقة الاستخدام: .حساب المعادلة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الروابط$",
    command=("اوامر الروابط", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الروابط 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.دنس` ⦘
❐ كشف نظام دومين الموقع
❐ طريقة الاستخدام: .دنس الرابط

☑️ ⦗ `.مصغر` ⦘
❐ تصغير الرابط
❐ طريقة الاستخدام: بالرد على الرابط

☑️ ⦗ `.رابط_مخفي` ⦘
❐ إخفاء الرابط في مسافة معينة
❐ طريقة الاستخدام: بالرد على الرابط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التحذيرات$",
    command=("اوامر التحذيرات", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التحذيرات 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تحذير` ⦘
❐ تحذير عضو مع سبب
❐ طريقة الاستخدام: .تحذير السبب بالرد

☑️ ⦗ `.التحذيرات` ⦘
❐ عرض تحذيرات العضو
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.حذف التحذيرات` ⦘
❐ حذف تحذيرات العضو
❐ طريقة الاستخدام: بالرد على الشخص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر اللستة$",
    command=("اوامر اللستة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر اللستة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.لستة` ⦘
❐ صنع لستة شفافة للمنشور
❐ طريقة الاستخدام: مع المنشور

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الملكية$",
    command=("اوامر الملكية", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الملكية 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ملكية` ⦘
❐ نقل ملكية القناة لشخص
❐ طريقة الاستخدام: .ملكية معرف الشخص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر السليب$",
    command=("اوامر السليب", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر السليب 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.سليب` ⦘
❐ وضعك في وضع غير المتصل
❐ طريقة الاستخدام: .سليب السبب

☑️ ⦗ `.سليب_ميديا` ⦘
❐ سليب مع صورة أو متحركة
❐ طريقة الاستخدام: .سليب_ميديا السبب بالرد

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر ترحيب البوت$",
    command=("اوامر ترحيب البوت", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر ترحيب البوت 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تفعيل الترحيب` ⦘
❐ تفعيل ترحيب البوت التلقائي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.تعطيل الترحيب` ⦘
❐ تعطيل ترحيب البوت التلقائي
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الاسم$",
    command=("اوامر الاسم", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الاسم 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.اسم وقتي` ⦘
❐ إضافة اسم وقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انهاء اسم وقتي` ⦘
❐ إنهاء الاسم الوقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الصورة الوقتية` ⦘
❐ وضع صورة تتغير مع الوقت
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انهاء الصورة الوقتية` ⦘
❐ إنهاء الصورة الوقتية
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر البايو$",
    command=("اوامر البايو", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر البايو 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.بايو وقتي` ⦘
❐ إضافة بايو وقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انهاء بايو وقتي` ⦘
❐ إنهاء البايو الوقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الكروب الوقتي$",
    command=("اوامر الكروب الوقتي", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الكروب الوقتي 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.كروب وقتي` ⦘
❐ إضافة كروب وقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انهاء كروب وقتي` ⦘
❐ إنهاء الكروب الوقتي
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.كروب صورة وقتي` ⦘
❐ تشغيل الصورة الوقتية للمجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.انهاء كروب صورة وقتي` ⦘
❐ إنهاء الصورة الوقتية للمجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التشغيل$",
    command=("اوامر التشغيل", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التشغيل 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.اعادة التشغيل` ⦘
❐ إعادة تشغيل البوت
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.تحديث` ⦘
❐ التحقق من التحديثات
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.التحديثات تشغيل` ⦘
❐ تشغيل الرسالة التجريبية
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.التحديثات ايقاف` ⦘
❐ إيقاف الرسالة التجريبية
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الاطفاء$",
    command=("اوامر الاطفاء", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الاطفاء 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.اطفاء` ⦘
❐ إيقاف تشغيل البوت
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الكشف$",
    command=("اوامر الكشف", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الكشف 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.الايدي` ⦘
❐ عرض معلومات العضو
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.ايدي` ⦘
❐ عرض معلومات العضو بشكل مبسط
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.كشف` ⦘
❐ عرض معلومات العضو
❐ طريقة الاستخدام: بالرد على الشخص

☑️ ⦗ `.رابط الحساب` ⦘
❐ الحصول على رابط الحساب
❐ طريقة الاستخدام: بالرد على الشخص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر كوكل$",
    command=("اوامر كوكل", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر كوكل 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.صور` ⦘
❐ الحصول على صور من جوجل
❐ طريقة الاستخدام: .صور 10 النص

☑️ ⦗ `.استخرج` ⦘
❐ استخراج النصوص من الصور
❐ طريقة الاستخدام: .استخرج عربي بالرد

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الاذاعه$",
    command=("اوامر الاذاعه", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الإذاعة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.وجه` ⦘
❐ إذاعة نص للمجموعات
❐ طريقة الاستخدام: .وجه النص

☑️ ⦗ `.حول` ⦘
❐ إذاعة نص للخاص
❐ طريقة الاستخدام: .حول النص

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الصوره الذاتيه$",
    command=("اوامر الصوره الذاتيه", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الصورة الذاتية 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ذاتية` ⦘
❐ حفظ الصورة الذاتية التدمير
❐ طريقة الاستخدام: بالرد على الصورة

☑️ ⦗ `.حفظ` ⦘
❐ حفظ الصورة المقيدة
❐ طريقة الاستخدام: بالرد على الصورة

☑️ ⦗ `.الذاتية تشغيل` ⦘
❐ تفعيل حفظ الصور الذاتية تلقائياً
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الذاتية تعطيل` ⦘
❐ تعطيل حفظ الصور الذاتية
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر البصمه الذاتيه$",
    command=("اوامر البصمه الذاتيه", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر البصمة الذاتية 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.صوت` ⦘
❐ حفظ البصمة الذاتية التدمير
❐ طريقة الاستخدام: بالرد على البصمة

☑️ ⦗ `.جلب الصوت` ⦘
❐ حفظ البصمة المقيدة
❐ طريقة الاستخدام: بالرد على البصمة

☑️ ⦗ `.الصوت تشغيل` ⦘
❐ تفعيل حفظ البصمات الذاتية تلقائياً
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.الصوت تعطيل` ⦘
❐ تعطيل حفظ البصمات الذاتية
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التسلية$",
    command=("اوامر التسلية", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التسلية 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تسلية 1` ⦘
☑️ ⦗ `.تسلية 2` ⦘
☑️ ⦗ `.تسلية 3` ⦘
☑️ ⦗ `.تسلية 4` ⦘
☑️ ⦗ `.تسلية 5` ⦘
☑️ ⦗ `.تسلية 6` ⦘
☑️ ⦗ `.تسلية 7` ⦘
☑️ ⦗ `.تسلية 8` ⦘
☑️ ⦗ `.فيك typing 300` ⦘
☑️ ⦗ `.رفع ادمن` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التحشيش$",
    command=("اوامر التحشيش", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التحشيش 𓆪
━━━━━━━━━━━━━━━━━━━━

جميع الأوامر تستخدم بالرد على الشخص

☑️ ⦗ `.رفع تاج` ⦘
☑️ ⦗ `.رفع بكلبي` ⦘
☑️ ⦗ `.رفع مطي` ⦘
☑️ ⦗ `.رفع جلب` ⦘
☑️ ⦗ `.رفع قرد` ⦘
☑️ ⦗ `.رفع مرتي` ⦘
☑️ ⦗ `.رفع زوجي` ⦘
☑️ ⦗ `.نسبة الانوثة` ⦘
☑️ ⦗ `.نسبة الحب` ⦘
☑️ ⦗ `.نسبة الغباء` ⦘
☑️ ⦗ `.رفع زاحف` ⦘
☑️ ⦗ `.رفع كحبة` ⦘
☑️ ⦗ `.رفع فرخ` ⦘
☑️ ⦗ `.رزله` ⦘
☑️ ⦗ `.رفع صاك` ⦘
☑️ ⦗ `.رفع حاته` ⦘
☑️ ⦗ `.رفع بقره` ⦘
☑️ ⦗ `.رفع ايجة` ⦘
☑️ ⦗ `.رفع زبال` ⦘
☑️ ⦗ `.رفع كواد` ⦘
☑️ ⦗ `.رفع ديوث` ⦘
☑️ ⦗ `.رفع مجنب` ⦘
☑️ ⦗ `.رفع مميز` ⦘
☑️ ⦗ `.رفع ادمن` ⦘
☑️ ⦗ `.رفع منشئ` ⦘
☑️ ⦗ `.رفع مالك` ⦘
☑️ ⦗ `.رفع وصخ` ⦘
☑️ ⦗ `.نسبة الكذب` ⦘
☑️ ⦗ `.نسبة الدياثه` ⦘
☑️ ⦗ `.نسبة الشذوذ` ⦘
☑️ ⦗ `.نسبة الجمال` ⦘
☑️ ⦗ `.نسبة الخيانه` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التحويل$",
    command=("اوامر التحويل", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التحويل 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تحويل صورة` ⦘
❐ تحويل الملصق إلى صورة
❐ طريقة الاستخدام: بالرد على الملصق

☑️ ⦗ `.تحويل ملصق` ⦘
❐ تحويل الصورة إلى ملصق
❐ طريقة الاستخدام: بالرد على الصورة

☑️ ⦗ `.تحويل voice` ⦘
❐ تحويل المقطع إلى بصمة صوتية
❐ طريقة الاستخدام: بالرد على المقطع

☑️ ⦗ `.تحويل mp3` ⦘
❐ تحويل البصمة إلى مقطع mp3
❐ طريقة الاستخدام: بالرد على البصمة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الجهات$",
    command=("اوامر الجهات", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الجهات 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ضيف` ⦘
❐ إضافة أعضاء من مجموعة أخرى
❐ طريقة الاستخدام: .ضيف رابط المجموعة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الحساب$",
    command=("اوامر الحساب", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الحساب 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.معلوماتي` ⦘
☑️ ⦗ `.قائمه قنواتي` ⦘
☑️ ⦗ `.قائمه كروباتي` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الترفيه$",
    command=("اوامر الترفيه", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الترفيه 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.بلي` ⦘
☑️ ⦗ `.كت` ⦘
☑️ ⦗ `.خيروك` ⦘
☑️ ⦗ `.غنيلي` ⦘
☑️ ⦗ `.شعر` ⦘
☑️ ⦗ `.قران` ⦘
☑️ ⦗ `.البنك` ⦘
☑️ ⦗ `.فلم` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر بصمات الميمز$",
    command=("اوامر بصمات الميمز", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر بصمات الميمز 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ازالة` ⦘
❐ إزالة بصمة معينة

☑️ ⦗ `.قائمة الميمز` ⦘
❐ عرض قائمة البصمات المضافة

☑️ ⦗ `.ازالة_البصمات` ⦘
❐ إزالة جميع البصمات المضافة

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الفارات$",
    command=("اوامر الفارات", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الفارات 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.جلب` ⦘
❐ جلب قيمة فار معين
❐ طريقة الاستخدام: .جلب اسم الفار

☑️ ⦗ `.وضع توقيت` ⦘
❐ وضع المنطقة الزمنية
❐ طريقة الاستخدام: بالرد على المنطقة

☑️ ⦗ `.وضع رمز الاسم` ⦘
❐ وضع رمز الاسم
❐ طريقة الاستخدام: بالرد على الرمز

☑️ ⦗ `.وضع الكروب` ⦘
❐ وضع اسم الكروب
❐ طريقة الاستخدام: بالرد على الاسم

☑️ ⦗ `.وضع البايو` ⦘
❐ وضع البايو
❐ طريقة الاستخدام: بالرد على النبذة

☑️ ⦗ `.وضع لون وقتي` ⦘
❐ وضع لون الوقتي
❐ طريقة الاستخدام: بالرد على اللون

☑️ ⦗ `.وضع الصورة` ⦘
❐ وضع الصورة الشخصية
❐ طريقة الاستخدام: بالرد على رابط الصورة

☑️ ⦗ `.وضع صورة الكروب` ⦘
❐ وضع صورة الكروب
❐ طريقة الاستخدام: بالرد على رابط الصورة

☑️ ⦗ `.وضع زخرفة الارقام` ⦘
❐ وضع زخرفة الأرقام
❐ طريقة الاستخدام: بالرد على الأرقام

☑️ ⦗ `.وضع اسم` ⦘
❐ وضع الاسم
❐ طريقة الاستخدام: بالرد على الاسم

☑️ ⦗ `.وضع كروب التخزين` ⦘
❐ وضع كروب التخزين
❐ طريقة الاستخدام: بالرد على الأيدي

☑️ ⦗ `.وضع كروب الحفظ` ⦘
❐ وضع كروب الحفظ
❐ طريقة الاستخدام: بالرد على الأيدي

☑️ ⦗ `.وقت العراق` ⦘
❐ ضبط توقيت العراق

☑️ ⦗ `.وقت السعودية` ⦘
❐ ضبط توقيت السعودية

☑️ ⦗ `.وقت مصر` ⦘
❐ ضبط توقيت مصر

☑️ ⦗ `.وقت الاردن` ⦘
❐ ضبط توقيت الأردن

☑️ ⦗ `.وقت اليمن` ⦘
❐ ضبط توقيت اليمن

☑️ ⦗ `.وقت سوريا` ⦘
❐ ضبط توقيت سوريا

تنويه: استخدم (محو) بدل (وضع) لحذف الفار

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التجميع$",
    command=("اوامر التجميع", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التجميع 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تجميع العرب` ⦘
☑️ ⦗ `.تجميع دعمكم` ⦘
☑️ ⦗ `.تجميع الجوكر` ⦘
☑️ ⦗ `.تجميع المليار` ⦘
☑️ ⦗ `.تجميع العقاب` ⦘
☑️ ⦗ `.تجميع المليون` ⦘

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر وعد$",
    command=("اوامر وعد", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر وعد 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.راتب وعد` ⦘
❐ تجميع الأموال كل 10 دقائق
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.ايقاف راتب وعد` ⦘
❐ إيقاف تجميع الراتب
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.سرقة وعد` ⦘
❐ سرقة أموال شخص كل 10 دقائق
❐ طريقة الاستخدام: .سرقة وعد ايدي الشخص

☑️ ⦗ `.ايقاف سرقة وعد` ⦘
❐ إيقاف سرقة الأموال
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.بخشيش وعد` ⦘
❐ أخذ بخشيش كل 10 دقائق
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.ايقاف بخشيش وعد` ⦘
❐ إيقاف أخذ البخشيش
❐ طريقة الاستخدام: إرسال الأمر فقط

☑️ ⦗ `.استثمار وعد` ⦘
❐ استثمار الأموال كل 20 دقيقة
❐ طريقة الاستخدام: في المجموعة

☑️ ⦗ `.ايقاف استثمار وعد` ⦘
❐ إيقاف الاستثمار
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر المراقبة$",
    command=("اوامر المراقبة", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المراقبة 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.مراقبة` ⦘
❐ مراقبة شخص وإنشاء كروب خاص
❐ طريقة الاستخدام: .مراقبة معرف/ايدي الشخص

☑️ ⦗ `.الغاء مراقبة` ⦘
❐ إلغاء مراقبة الشخص
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر نقل اليوزرات$",
    command=("اوامر نقل اليوزرات", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر نقل اليوزرات 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.نقل_قناة` ⦘
❐ نقل اليوزر من حسابك إلى قناة
❐ طريقة الاستخدام: .نقل_قناة @username

☑️ ⦗ `.نقل_حساب` ⦘
❐ نقل اليوزر من قناة إلى حسابك
❐ طريقة الاستخدام: .نقل_حساب @username

☑️ ⦗ `.نقل_بوت_القناة` ⦘
❐ نقل اليوزر من قناتك إلى بوت فاذر
❐ طريقة الاستخدام: .نقل_بوت_القناة @userbot

☑️ ⦗ `.نقل_بوت_الحساب` ⦘
❐ نقل اليوزر من حسابك إلى بوت فاذر
❐ طريقة الاستخدام: .نقل_بوت_الحساب @userbot

☑️ ⦗ `.الصيد` ⦘
❐ عرض أوامر الصيد

☑️ ⦗ `.التثبيت` ⦘
❐ عرض أوامر التثبيت

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الميمز$",
    command=("اوامر الميمز", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الميمز 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.ميمز` ⦘
❐ عرض قائمة أوامر الميمز
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر التخصيص$",
    command=("اوامر التخصيص", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التخصيص 𓆪
━━━━━━━━━━━━━━━━━━━━

☑️ ⦗ `.تخصيص` ⦘
❐ أوامر التخصيص متوفرة قريباً

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )

@l313l.ar_cmd(
    pattern="اوامر الاذكار$",
    command=("اوامر الاذكار", plugin_category),
)
async def _(event):
    await event.edit(
        """𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الأذكار 𓆪
━━━━━━━━━━━━━━━━━━━━

- ( .اذكار الصباح ) 
- ( .اذكار المساء )   
- (.اذكار النوم)
- ( .اذكار الصلاة) 
- ( .اذكار الاستيقاظ ) 
- ( .احاديث )
- ( .اذكار )
- ( .اذكار عشر )

❐ عرض الأذكار
❐ طريقة الاستخدام: إرسال الأمر فقط

•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•
⌔︙Dev : @Lx5x5"""
    )
