import random
import os
from telethon import events, types
from telethon.tl import functions
from telethon.tl.functions.messages import GetCustomEmojiDocumentsRequest
from telethon.extensions import html, markdown
from telethon.errors.rpcerrorlist import ChatSendMediaForbiddenError
from ..core.managers import edit_or_reply, edit_delete
from ..Config import Config
from ..sql_helper.globals import gvarstatus
from . import l313l

# المتغيرات الأساسية
ZED_BLACKLIST = [-1001935599871]
Zel_Uid = l313l.uid
plugin_category = "utils"

# كلاس التحليل المخصص
class CustomParseMode:
    def __init__(self, parse_mode: str):
        self.parse_mode = parse_mode

    def parse(self, text):
        if self.parse_mode == 'html':
            text, entities = html.parse(text)
            # معالجة إيموجيات البريميوم
            for i, e in enumerate(entities):
                if isinstance(e, types.MessageEntityTextUrl):
                    if e.url.startswith('emoji/'):
                        document_id = int(e.url.split('/')[1])
                        entities[i] = types.MessageEntityCustomEmoji(
                            offset=e.offset,
                            length=e.length,
                            document_id=document_id
                        )
            return text, entities
        elif self.parse_mode == 'markdown':
            return markdown.parse(text)
        raise ValueError("Unsupported parse mode")

    @staticmethod
    def unparse(text, entities):
        return html.unparse(text, entities)
rehu = [
    "قال المهدي(عجل الله فرجه):الدّينُ لمحمّد صلى الله عليه وآله وسلم والهدايةُ لعَلِيٍّ أمير المؤمنين ع، لأنها لهُ وفي عَقِبِه باقيةً إلى يومِ القيامة",
    "قال المهدي(عجل الله فرجه):إذا استغفرت الله (عز وجل) فالله يغفر لك",
    "قال المهدي(عجل الله فرجه):لا يحلّ لأحد أن يتصرّف في مال غيره بغير إذنه",
    "قال المهدي(عجل الله فرجه):إن اُستَرشدت أُرشِدتَ، وإن طَلبت وجدت",
    "قَالَ الإمام علي (عليه السلام): يَا ابْنَ آدَمَ إِذَا رَأَيْتَ رَبَّكَ سُبْحَانَهُ يُتَابِعُ عَلَيْكَ نِعَمَهُ وَأَنْتَ تَعْصِيهِ فَاحْذَرْهُ",
    "قَالَ الإمام علي (عليه السلام): الصَّبْرُ صَبْرَانِ صَبْرٌ عَلَى مَا تَكْرَهُ وَصَبْرٌ عَمَّا تُحِبُّ",
    "قَالَ الإمام علي (عليه السلام): لَا يَكُونُ الصَّدِيقُ صَدِيقاً حَتَّى يَحْفَظَ أَخَاهُ فِي ثَلَاثٍ فِي نَكْبَتِهِ وَغَيْبَتِهِ وَوَفَاتِهِ",
    "قال الإمام الصادق(عليه السلام): اكتبوا فإنكم لا تحفظون حتى تكتبو",
    "قال الإمام الصادق(عليه السلام): ركعة يصليها الفقيه أفضل من سبعين ألف ركعة يصليها العابد",
    "قال الإمام الصادق(عليه السلام): طلب العلم فريضة من فرائض الله",
    "عن رسول الله (صلى الله عليه وآله): الْبَخِيلُ‏ حَقّاً مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ",
    "عن رسول الله (صلى الله عليه وآله): مَنْ أَتَانِي ��َائِراً كُنْتُ شَفِيعَهُ‏ يَوْمَ‏ الْقِيَامَة",
    "عن رسول الله (صلى الله عليه وآله): بُغْضُ‏ عَلِيٍ‏ كُفْرٌ وَ بُغْضُ بَنِي هَاشِمٍ نِفَاقٌ",
    "عن الامام علي (عليه السلام) قال : أعظم الذنوب ما استخف به صاحبه",
    "عن الامام علي (عليه السلام) قال : إذا قويت فاقو على طاعة الله، وإذا ضعفت فاضعف في معصيته",
    "عن الامام علي (عليه السلام) قال : أعداؤك ثلاثة: عدوك، وصديق عدوك، وعدو صديقك",
    "عن الامام علي (عليه السلام) قال : لا غنى كالعقل، ولا فقر كالجهل، ولا ميراث كالأدب",
    "عن الامام علي (عليه السلام) قال : لسانك حصانك، إن صنته صانك",
]

@l313l.ar_cmd(
    pattern="الاوامر(?:\s|$)([\s\S]*)",
    command=("الاوامر", plugin_category),
    info={
        "header": "امـر مختصـر لـ عـرض قائـمة الاوامـر",
        "الاستـخـدام": " {tr}الإوامر",
    },
)
async def show_commands(event):
    if (event.chat_id in ZED_BLACKLIST) and (Zel_Uid not in Zed_Dev):
        return await edit_or_reply(event, "**- عـذراً .. عـزيـزي 🚷\n- لا تستطيـع استخـدام هـذا الامـر هـنا 🚫**")
    
    zed = await edit_or_reply(event, "**⇆ جاري تجهيز الأوامر...**")
    lMl10l = random.choice(rehu)
    
    # التحقق إذا كان المستخدم لديه بريميوم
    try:
        mypremium = (await event.client.get_entity(Zel_Uid)).premium
    except:
        mypremium = False
    
    if mypremium:
        # النسخة الفخمة للمستخدمين بريميوم
        caption = f"<b>✦ قائـمة اوامـر سـورس آراس </b>"
        caption += f'<a href="emoji/5668127928907464707">❤️</a>\n\n'
        
        caption += (
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م1</code> ⦙ أوامر الإدارة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م2</code> ⦙ أوامر المجموعة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م3</code> ⦙ أوامر الترحيب والردود\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م4</code> ⦙ حماية الخاص والتلكراف\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م5</code> ⦙ أوامر المنشن والانتحال\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م6</code> ⦙ أوامر التحميل والترجمة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م7</code> ⦙ أوامر المنع والقفل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م8</code> ⦙ أوامر التنظيف والتكرار\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م9</code> ⦙ أوامر التخصيص والفارات\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م10</code> ⦙ أوامر الوقتي والتشغيل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م11</code> ⦙ أوامر الكشف والروابط\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م12</code> ⦙ أوامر المساعدة والإذاعة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م13</code> ⦙ أوامر الإرسال والأذكار\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م14</code> ⦙ أوامر الملصقات وكوكل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م15</code> ⦙ أوامر التسلية والميمز\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م16</code> ⦙ أوامر الصيغ والجهات\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م17</code> ⦙ أوامر التمبلر والزغرفة\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م18</code> ⦙ أوامر الحساب والترفيه\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م19</code> ⦙ أوامر الميوزك والتشغيل\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م20</code> ⦙ أوامر تجميع النقاط وبوت وعد\n'
            f'<a href="emoji/5210763312597326700">❤️</a> <code>.م21</code> ⦙ أوامر الذاتية للبصمات والصور\n'
            f'ٴ<a href="emoji/6323136954380585694">❤️</a>'
            f'<a href="emoji/6325684673145997914">❤️</a>'
            f'<a href="emoji/6323205570778107774">❤️</a>'
            f'<a href="emoji/6323518746908428943">❤️</a>'
            f'<a href="emoji/5834774412338927340">❤️</a>'
            f'<a href="emoji/6325480992911919689">❤️</a>'
            f'<a href="emoji/6323564170482551899">❤️</a>'
            f'<a href="emoji/6323191058083613275">❤️</a>'
            f'<a href="emoji/6325310787652946500">❤️</a>\n'
            f'<a href="emoji/5222295067858855800">❤️</a> <b>┊ حكمة اليوم:</b>\n'
            f"<code>{lMl10l}</code>\n"
            f'ٴ<a href="emoji/6323136954380585694">❤️</a>'
            f'<a href="emoji/6325684673145997914">❤️</a>'
            f'<a href="emoji/6323205570778107774">❤️</a>'
            f'<a href="emoji/6323518746908428943">❤️</a>'
            f'<a href="emoji/5463151916080966718">❤️</a>'
            f'<a href="emoji/6325480992911919689">❤️</a>'
            f'<a href="emoji/6323564170482551899">❤️</a>'
            f'<a href="emoji/6323191058083613275">❤️</a>'
            f'<a href="emoji/6325310787652946500">❤️</a>\n'
            f'<a href="emoji/5219998342687242062">❤️</a> <b> المـطـور: @Lx5x5</b>\n'
        )
        
        try:
            await event.client.send_message(
                event.chat_id,
                caption,
                link_preview=False,
                parse_mode=CustomParseMode("html"),
            )
            await zed.delete()
        except Exception as e:
            await edit_or_reply(zed, f"**حدث خطأ:** {str(e)}")
    
    else:
        # النسخة العادية للمستخدمين بدون بريميوم
        await zed.edit(
            f"**✦ قائـمة اوامـر سـورس آراس **"
            f"\n\n"
            f"**• `.م1`  ⦙  أوامر الإدارة **\n"
            f"**• `.م2`  ⦙  أوامر المجموعة **\n"
            f"**• `.م3`  ⦙  أوامر الترحيب والردود **\n"
            f"**• `.م4`  ⦙  حماية الخاص والتلكراف **\n"
            f"**• `.م5`  ⦙  أوامر المنشن والانتحال **\n"
            f"**• `.م6`  ⦙  أوامر التحميل والترجمة **\n"
            f"**• `.م7`  ⦙  أوامر المنع والقفل **\n"
            f"**• `.م8`  ⦙  أوامر التنظيف والتكرار **\n"
            f"**• `.م9`  ⦙  أوامر التخصيص والفارات **\n"
            f"**• `.م10` ⦙  أوامر الوقتي والتشغيل **\n"
            f"**• `.م11` ⦙  أوامر الكشف والروابط **\n"
            f"**• `.م12` ⦙  أوامر المساعدة والإذاعة **\n"
            f"**• `.م13` ⦙  أوامر الإرسال والأذكار **\n"
            f"**• `.م14` ⦙  أوامر الملصقات وكوكل **\n"
            f"**• `.م15` ⦙  أوامر التسلية والميمز **\n"
            f"**• `.م16` ⦙  أوامر الصيغ والجهات **\n"
            f"**• `.م17` ⦙  أوامر التمبلر والزغرفة **\n"
            f"**• `.م18` ⦙  أوامر الحساب والترفيه **\n"
            f"**• `.م19` ⦙  أوامر الميوزك والتشغيل **\n"
            f"**• `.م20` ⦙  أوامر تجميع النقاط وبوت وعد **\n"
            f"**• `.م21` ⦙  أوامر الذاتية للبصمات والصور **\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━\n"
            f"**📜┊ حكمة اليوم:**\n"
            f"`{lMl10l}`\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━\n"
            f"**⚡┊ المطور: @Lx5x5**\n"
            f"━━━━━━━━━━━━━━━━━━━━━━━━━"
        )

commands = {
    "م1": """** قائمة اوامر الادمن لسورس آراس **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الحظر` )
- ( `.اوامر الكتم` )
- ( `.اوامر التثبيت` )
- ( `.اوامر الاشراف` )
- ( `.اوامر التحذيرات` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م2": """** قائمة اوامر المجـموعه لسورس آراس **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التفليش` )
- ( `.اوامر المحذوفين` )
- ( `.اوامر الكروب` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م3": """** قائمة اوامر الـترحيب والـردود **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الترحيب` )
- ( `.اوامر الردود` )
- ( `.اوامر المحاكاة` )
- ( `.اوامر ترحيب البوت` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م4": """** قائمة اوامر حـماية الخاص والتلكراف **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الحماية` )
- ( `.اوامر التلكراف` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م5": """** قائمة اوامر الـمنشن والانتحال **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الانتحال` )
- ( `.اوامر التقليد` )
- ( `.اوامر المنشن` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م6": """** قائمة اوامر التحميل والترجمه **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر النطق` )
- ( `.اوامر التحميل` )
- ( `.اوامر الترجمة` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م7": """** قائمة اوامر القفل والمنع **:
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر القفل` )
- ( `.اوامر الفتح` )
- ( `.اوامر المنع` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م8": """** قائمة اوامر التكرار والتنظيف **:
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التكرار` )
- ( `.اوامر السبام` )
- ( `.اوامر التنظيف` )
- ( `.اوامر المسح` )
- ( `.اوامر الرسائل الموقته` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م9": """** قائمة التخصيص والفارات **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التخصيص` )
لتغير الصور والكلايش كل من الحماية والفحص والبنك
- ( `.اوامر الفارات` )
- لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م10": """** قائمة اوامر الوقتي والتشغيل **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الاسم` )
- ( `.اوامر البايو` )
- ( `.اوامر الكروب الوقتي` )
- ( `.اوامر التشغيل` )
- ( `.اوامر الاطفاء` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م11": """** قائمة اوامر الكـشف و الروابط **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الكشف` )
- ( `.اوامر الروابط` )

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م12": """** قائمة اوامر المساعدة  **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الوقت والتاريخ` )
- ( `.اوامر الصلاة` )
- ( `.اوامر الذكاء` )
- ( `.اوامر مساعدة` )
- ( `.اوامر الاذاعه` )
- ( `.اوامر الوقتي` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م13": """** قائمة اوامر الارسال **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر اللستة` )
- ( `.اوامر الملكية` )
- ( `.اوامر السليب` )
- ( `.اوامر الاذكار` )
- ( `.اوامر الاقتباس` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م14": """** قائمة اوامر الملصقات وكوكل **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الملصقات` )
- ( `.اوامر كوكل` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م15": """** قائمة اوامر التسلية والتحشيش **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التسلية` )
- ( `.اوامر التحشيش` )
- ( `.اوامر بصمات الميمز` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م16": """** قائمة اوامر تحويل الصيغ و الجهات **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التحويل` )
- ( `.اوامر الجهات` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م18": """** قائمة اوامر الحساب و الترفيه **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الترفيه` )
- ( `.اوامر الالعاب الذكيه` )
- ( `.اوامر الحساب` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م19": """ قائمة اوامر الميوزك والتشغيل 🎵
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر
 ⌔︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` )
- ( `.تشغيل_المكالمة` )
- لتشغيل المحادثة الصوتيه
- ( `.انهاء_المكالمة` )
-لأنهاء المحادثه الصوتية
- ( `.دعوة` )
- بالرد على الشخص لدعوته الى المكالمة
- ( `.معلومات_المكالمة` )
- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها
- ( `.تسمية_المكالمة` )
- لتغير عنوان المكالمة
- ( `.انضمام` )
- للأنضمام الى المحادثة الصوتية
- ( `.مغادرة` )
- لمغادرة المحادثة الصوتية
- ( `.تشغيل` )
-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه
- ( `.قائمة_التشغيل` )
- لعرض قائمة التشغيل
- ( `.ايقاف_مؤقت` )
- لأيقاف الاغنية الحالية مؤقتا
- ( `.استمرار` )
-لأستمرار الاغنيه التي تم ايقافها
- ( `.تخطي` )
- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    
    "م20": """** قائمة اوامر تجميع النقاط و بوت وعد **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر التجميع` )
- ( `.اوامر وعد` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev : @Lx5x5""",

    "م21": """** قائمة اوامر الذاتية للبصمات والصور **:
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الصوره الذاتيه` )
- ( `.اوامر البصمه الذاتيه` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙Dev :@Lx5x5"""
}

@l313l.ar_cmd(pattern="(م1|م2|م3|م4|م5|م6|م7|م8|م9|م10|م11|م12|م13|م14|م15|م16|م18|م19|م20|م21)$")
async def handle_commands(event):
    command = event.pattern_match.group(1)
    if command in commands:
        await event.edit(commands[command])


import random
from telethon import events
import random, re
from telethon.extensions import html, markdown
from telethon.tl import types

from JoKeRUB.utils import admin_cmd

import asyncio
from JoKeRUB import l313l

from ..core.managers import edit_or_reply

plugin_category = "extra"

class CustomParseMode:
    def __init__(self, parse_mode: str):
        self.parse_mode = parse_mode

    def parse(self, text):
        if self.parse_mode == 'html':
            text, entities = html.parse(text)
            for i, e in enumerate(entities):
                if isinstance(e, types.MessageEntityTextUrl):
                    if e.url.startswith('emoji/'):
                        document_id = int(e.url.split('/')[1])
                        entities[i] = types.MessageEntityCustomEmoji(
                            offset=e.offset,
                            length=e.length,
                            document_id=document_id
                        )
            return text, entities
        elif self.parse_mode == 'markdown':
            return markdown.parse(text)
        raise ValueError("Unsupported parse mode")

    @staticmethod
    def unparse(text, entities):
        return html.unparse(text, entities)


arras_emoji = 5667948420749328402

@l313l.ar_cmd(
    pattern="اوامر الحظر$",
    command=("اوامر الحظر", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الحظر 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.حظر</code> ⦘
❐ حظر عضو من المجموعة
❐ طريقة الاستخدام: <code>.حظر</code> بالرد على العضو

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.الغاء حظر</code> ⦘
❐ إلغاء حظر عضو محظور
❐ طريقة الاستخدام: <code>.الغاء حظر</code> بالرد على العضو

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
    )

@l313l.ar_cmd(
    pattern="اوامر الكتم$",
    command=("اوامر الكتم", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الكتم 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.كتم</code> ⦘
❐ كتم عضو في المجموعة
❐ طريقة الاستخدام: <code>.كتم</code> بالرد على العضو او كتابة يوزره

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.الغاء كتم</code> ⦘
❐ إلغاء كتم عضو مكتوم
❐ طريقة الاستخدام: <code>.الغاء كتم</code> بالرد على العضو او كتابة يوزره

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.كتم_مؤقت</code> ⦘
❐ كتم عضو مؤقتاً لمدة محددة
❐ طريقة الاستخدام: <code>.كتم_مؤقت 1h السبب</code>

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.مسح المكتومين</code> ⦘
❐ حذف جميع المكتومين
❐ طريقة الاستخدام: إرسال الأمر فقط

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
    )

@l313l.ar_cmd(
    pattern="اوامر التثبيت$",
    command=("اوامر التثبيت", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التثبيت 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.تثبيت</code> ⦘
❐ تثبيت رسالة في المجموعة
❐ طريقة الاستخدام: <code>.تثبيت</code> بالرد على الرسالة

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.الغاء التثبيت</code> ⦘
❐ إلغاء تثبيت رسالة مثبتة
❐ طريقة الاستخدام: <code>.الغاء التثبيت</code> بالرد على الرسالة

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
    )

@l313l.ar_cmd(
    pattern="اوامر الاشراف$",
    command=("اوامر الاشراف", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر الاشراف 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.رفع مشرف</code> ⦘
❐ رفع عضو كمشرف في المجموعة
❐ طريقة الاستخدام: <code>.رفع مشرف</code> بالرد على العضو او كتابة يوزره

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.تك</code> ⦘
❐ تنزيل عضو من الاشراف
❐ طريقة الاستخدام: <code>.تك</code> بالرد على العضو او كتابة يوزره

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.ارفع</code> ⦘
❐ رفع المشرف في جميع المجموعات
❐ مع كافة الصلاحيات ولقب مخفي

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.نزل</code> ⦘
❐ تنزيل الشخص من رتبة الاشراف
❐ في جميع المجموعات

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
    )

@l313l.ar_cmd(
    pattern="اوامر التفليش$",
    command=("اوامر التفليش", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر التفليش 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.تفليش بالطرد</code> ⦘
❐ طرد جميع أعضاء المجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.تفليش</code> ⦘
❐ حظر جميع أعضاء المجموعة
❐ طريقة الاستخدام: إرسال الأمر فقط

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.حظر_الكل</code> ⦘
❐ حظر الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.طرد_الكل</code> ⦘
❐ طرد الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.كتم_الكل</code> ⦘
❐ كتم الكل عن طريق بوت الحماية
❐ بدون صلاحيات إشراف

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
    )

@l313l.ar_cmd(
    pattern="اوامر المحذوفين$",
    command=("اوامر المحذوفين", plugin_category),
)
async def _(event):
    await event.edit(
        f"""<b>𓆩 𝐒𝐎𝐔𝐑𝐂𝐄 𝐀𝐑𝐀𝐒 - أوامر المحذوفين 𓆪</b>
━━━━━━━━━━━━━━━━━━━━

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.حذف المحظورين</code> ⦘
❐ إلغاء حظر جميع المحظورين
❐ طريقة الاستخدام: في المجموعة

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.اطردني</code> ⦘
❐ مغادرة المجوعة تلقائياً
❐ طريقة الاستخدام: إرسال الأمر في المجموعة

<a href="emoji/{arras_emoji}">☑️</a> ⦗ <code>.المحذوفين</code> ⦘
❐ عرض الحسابات المحذوفة
❐ طريقة الاستخدام: <code>.المحذوفين اطردهم</code>

<b>•ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ•</b>
<b>⌔︙Dev : @Lx5x5</b>""",
        parse_mode=CustomParseMode("html")
)
